frolic/pocket-pet/device/sdkconfig.defaults
# Values proven by the Waveshare 02_lvgl_demo_v9 example on this board.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_FREERTOS_HZ=1000

# Keep the LVGL draw buffer in internal SRAM: PSRAM draw buffers tear when
# the wifi stack contends for PSRAM bandwidth (ghost frames, banding).
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=65536
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=60
CONFIG_GDMA_ISR_IRAM_SAFE=y
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y

CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# CONFIG_PM_ENABLE is not set
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH=y
